loadtest/loadtest.1000.yml
config:
  target: http://localhost:3000
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 100
      name: Warm up phase
    - duration: 20
      arrivalRate: 100
      rampTo: 600
      name: Ramp up load
    - duration: 60
      arrivalRate: 1000
      name: Spike phase
scenarios:
  - flow:
    - get:
        url: "/"