loadtest/loadtest.yml
config:
  target: http://localhost:3000
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 50
      name: Warm up phase
    - duration: 50
      arrivalRate: 50
      rampTo: 100
      name: Ramp up load
    - duration: 120
      arrivalRate: 300
      name: Spike phase
scenarios:
  - flow:
    - get:
        url: "/"